{
  "backend/main.mo": "Main ICP actor implementing the full backend: user profiles, role-based access control, product CRUD, order management, and contact/feedback message storage with search and sorting utilities.",
  "backend/migration.mo": "Migration module that upgrades the actor state from an old schema (contact messages only) to a new schema that also includes products, orders, and their respective ID counters.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (order placement, admin panel, feedback form) to their relevant source files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one-to-two sentence summaries of every frontend source file, serving as a quick reference for the frontend codebase structure.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the shadcn-ui component system.",
  "frontend/index.html": "Minimal HTML shell titled 'Knots & Folds' that mounts the React app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with a root layout (Header + Footer) and two routes: the public HomePage at '/' and the AdminPage at '/admin'.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying the brand story, a product image with decorative overlays, and a grid of four value cards styled in the pink/purple palette.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard layout component with a header (logo + logout button) and tabbed navigation for Products, Orders, and Feedback sections.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form that validates a hardcoded password and calls an onLogin callback on success, with loading and error states.",
  "frontend/src/components/ContactForm.tsx": "Contact/feedback form with name, email, and message fields, client-side validation, and submission via a React Query mutation, showing a success state after submission.",
  "frontend/src/components/ContactSection.tsx": "Page section that renders contact information cards (email, custom orders, gifts, experience) alongside the ContactForm component.",
  "frontend/src/components/FeedbackTab.tsx": "Admin tab that fetches and displays all customer contact messages in a sortable table with loading, error, and empty states.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, social media links, quick-navigation scroll buttons, and a brand promise list on a dark plum background.",
  "frontend/src/components/Header.tsx": "Responsive fixed navigation header with scroll-aware background, smooth-scroll nav links, and a hamburger menu for mobile viewports.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, gradient overlays, animated tagline, CTA buttons, and decorative floating circles.",
  "frontend/src/components/OrderForm.tsx": "Modal dialog form for placing a customer order, with validation, product selection, and a success confirmation state using React Query mutations.",
  "frontend/src/components/OrdersTab.tsx": "Admin tab that displays all orders in a sortable table with color-coded status badges and an inline dropdown to update each order's status.",
  "frontend/src/components/ProductCard.tsx": "Reusable card component displaying a product image, category, description, handmade tags, and an optional 'Place Order' button.",
  "frontend/src/components/ProductFormModal.tsx": "Admin modal dialog for adding or editing a product, with form validation and React Query mutations for both create and update operations.",
  "frontend/src/components/ProductShowcase.tsx": "Displays a grid of three static woolen product cards with a section header and a bottom CTA that opens an OrderForm modal, either for a specific product or a general order.",
  "frontend/src/components/ProductsTab.tsx": "Admin tab component that lists all products in a table with edit/delete actions, and allows adding new products via a ProductFormModal with a confirmation dialog for deletions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with an authenticated identity and admin token when available, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, covering contact form submission, product CRUD operations, and order placement/retrieval/status updates.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind with a pink/purple OKLCH color palette for light and dark modes, and defines custom utility classes including font families and a yarn-texture background gradient.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin page that gates access behind a login form using sessionStorage, rendering either AdminLoginForm or AdminDashboard based on authentication state.",
  "frontend/src/pages/HomePage.tsx": "Home page component that composes the main public-facing sections: HeroSection, ProductShowcase, AboutSection, and ContactSection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those values via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts, OKLCH-based color tokens (including brand-specific pink/purple palette), border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the overall project state for the 'Knots & Folds' woolen goods website, recording its version, architectural notes, existing features, known issues, and high-level summary of implemented functionality including the order system, admin panel, and feedback form."
}