{
  "backend/main.mo": "Main Motoko actor for the Knots & Folds backend, implementing product CRUD, order management, contact messages, and user profiles with role-based access control via mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: removing the visible admin password hint and changing the password to 'namita6565' in AdminLoginForm.tsx, and fixing the createProduct mutation in useQueries.ts to call the correct backend method.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, describing their purpose, styling, and key functionality for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the Knots & Folds React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React app component using TanStack Router with hash history, a caffeineAdminToken URL normalization utility, and routes for the HomePage (/) and AdminPage (/admin) wrapped in a Header/Footer layout.",
  "frontend/src/components/AboutSection.tsx": "Two-column About section component featuring a brand story, decorative imagery, and a grid of value cards styled with the pink/purple palette.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component with a logo header, logout button, and tabbed interface for managing Products, Orders, and Feedback via their respective tab components.",
  "frontend/src/components/AdminLoginForm.tsx": "Renders a password-protected admin login form with show/hide toggle and a step-by-step access guide. Validates a hardcoded password and calls the onLogin callback on success.",
  "frontend/src/components/ContactForm.tsx": "A contact/feedback form with name, email, and message fields that validates input and submits via a React Query mutation. Shows a thank-you state after successful submission.",
  "frontend/src/components/ContactSection.tsx": "Page section that displays contact information (email and Instagram cards) alongside the ContactForm component, with a decorative header and feature highlights.",
  "frontend/src/components/FeedbackTab.tsx": "Admin panel tab that fetches and displays all customer contact messages in a sortable table with loading skeletons and empty/error states.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, social media links, quick navigation links, and a copyright notice rendered on a dark plum background with a wave SVG divider.",
  "frontend/src/components/Header.tsx": "Fixed site header with scroll-aware background, smooth-scroll desktop navigation links, a CTA button, and a hamburger-toggled mobile menu.",
  "frontend/src/components/HeroSection.tsx": "Renders the full-screen hero section for the Knots & Folds storefront, including a background image with overlays, animated decorative circles, brand headline, tagline, CTA buttons that smooth-scroll to sections, and stat badges.",
  "frontend/src/components/OrderForm.tsx": "A modal dialog form that lets customers place an order by entering their name, phone, address, product selection, and quantity, with validation and a success confirmation state.",
  "frontend/src/components/OrdersTab.tsx": "Admin tab that fetches and displays all orders in a sortable table with color-coded status badges and a dropdown to update each order's status.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product as a styled card with an image, category, description, handmade/wool tags, an optional badge, and an optional 'Place Order' button that triggers a callback.",
  "frontend/src/components/ProductFormModal.tsx": "Admin modal dialog for adding or editing a product, with form fields for name, description, price, stock, image URL, and category, supporting both create and update mutations.",
  "frontend/src/components/ProductShowcase.tsx": "Renders the products section with a static grid of three ProductCard items and manages the OrderForm modal state, including optional product pre-selection when a card's order button is clicked.",
  "frontend/src/components/ProductsTab.tsx": "Admin tab component that displays a table of all products with options to add, edit, and delete them, using modals and confirmation dialogs.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control if a token is present in the URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication state, login, and logout.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including products, orders, and contact messages (CRUD mutations and fetch queries).",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, configures Tailwind with a pink/purple OKLCH color palette, and defines custom utility classes including a yarn-texture background.",
  "frontend/src/main.tsx": "Application entry point that wraps the App component with React Query and InternetIdentityProvider providers and mounts it to the DOM.",
  "frontend/src/pages/AdminPage.tsx": "Admin page that conditionally renders either the login form or the dashboard based on session-stored authentication state.",
  "frontend/src/pages/HomePage.tsx": "Home page that composes the Hero, ProductShowcase, About, and Contact sections into a single page layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Playfair Display, Lato, Caveat), a pink/purple brand color palette using oklch values, custom border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for 'Knots & Folds', a woolen goods brand website, documenting architectural notes, existing features, known issues (broken Add Product functionality), and key details like the admin password and contact email."
}