{
  "kind": "build_request",
  "title": "Remove password display, change password to namita6565, fix Add Product",
  "projectName": "Knots & Folds",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Update frontend/src/components/AdminLoginForm.tsx to remove all visible password display (no 'Admin Password: ...' label or info box showing the password). Change the hardcoded password check from 'knots2024' to 'namita6565'. The login form must still include the password input field, login button, error handling, and step-by-step guide panel — only the visible password hint text must be removed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "remove the password display from it",
          "change the password to namita6565"
        ]
      },
      "acceptanceCriteria": [
        "The AdminLoginForm screen does not show the admin password in any visible label, badge, or info box.",
        "Entering 'namita6565' in the password field and clicking Login grants access to the AdminDashboard.",
        "Entering any other password shows an inline error message.",
        "The step-by-step guide panel (how to navigate to /admin, enter password, use tabs) remains visible on the login screen.",
        "Session is persisted via sessionStorage key 'adminAuthenticated' set to 'true' on successful login."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Fix the Add Product functionality in the admin dashboard. Investigate and resolve why submitting the ProductFormModal does not create/save a new product. Ensure the createProduct mutation in useQueries.ts correctly calls the backend addProduct (or equivalent) method, the backend Motoko actor's addProduct function is correctly defined and stores the product, and the ProductsTab/ProductFormModal correctly invokes the mutation and refreshes the product list after a successful creation.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "i cant add products please fix it"
        ]
      },
      "acceptanceCriteria": [
        "Opening the 'Add Product' modal in the Products tab, filling in all required fields (name, description, price, stock, image URL, category), and submitting successfully saves the product.",
        "The new product appears in the products table immediately after creation without a full page reload.",
        "No console errors occur during product creation.",
        "The backend correctly stores the new product and returns it in subsequent getProducts calls.",
        "Editing and deleting existing products continue to work correctly."
      ]
    }
  ],
  "constraints": [
    "Do not change any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Do not break the existing sessionStorage-based admin authentication flow in AdminPage.tsx.",
    "Do not revert or remove the hash-URL normalization logic in App.tsx that handles caffeineAdminToken."
  ],
  "nonGoals": [
    "Changing the visual theme or color palette.",
    "Adding new admin panel features beyond fixing product creation.",
    "Modifying the Orders or Feedback tabs.",
    "Changing the routing logic in App.tsx or urlParams.ts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}