{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove password display, change password to namita6565, fix Add Product",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Update AdminLoginForm to remove visible password display and change hardcoded password to 'namita6565'",
      "acceptanceCriteria": [
        "The AdminLoginForm screen does not show the admin password in any visible label, badge, or info box.",
        "Entering 'namita6565' in the password field and clicking Login grants access to the AdminDashboard.",
        "Entering any other password shows an inline error message.",
        "The step-by-step guide panel (how to navigate to /admin, enter password, use tabs) remains visible on the login screen.",
        "Session is persisted via sessionStorage key 'adminAuthenticated' set to 'true' on successful login."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminLoginForm.tsx",
          "operation": "modify",
          "description": "Remove all visible password display elements (any 'Admin Password: ...' label, info box, or badge showing the password). Change the hardcoded password check from 'knots2024' to 'namita6565'. Retain the password input field, login button, error handling, and the step-by-step guide panel. Ensure sessionStorage 'adminAuthenticated' is set to 'true' on successful login."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Fix Add Product functionality in admin dashboard to correctly create and save new products",
      "acceptanceCriteria": [
        "Opening the 'Add Product' modal in the Products tab, filling in all required fields (name, description, price, stock, image URL, category), and submitting successfully saves the product.",
        "The new product appears in the products table immediately after creation without a full page reload.",
        "No console errors occur during product creation.",
        "The backend correctly stores the new product and returns it in subsequent getProducts calls.",
        "Editing and deleting existing products continue to work correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Investigate and fix the createProduct mutation. Ensure it correctly calls actor.createProduct with all required parameters (name, description, price, stockQuantity as bigint, imageUrl, category). Verify the mutation's onSuccess callback invalidates the products query cache to trigger a refetch. Check that BigInt conversions for price and stockQuantity are handled correctly. Review the backend interface at frontend/src/backend.d.ts to confirm method signature matches: createProduct(name: string, description: string, price: number, stockQuantity: bigint, imageUrl: string, category: string): Promise<{id: bigint}>."
        },
        {
          "path": "frontend/src/components/ProductFormModal.tsx",
          "operation": "modify",
          "description": "Review and fix the form submission logic. Ensure all form fields (name, description, price, stock, imageUrl, category) are collected correctly and passed to the createProduct mutation from useQueries. Verify that numeric fields (price, stock) are properly validated and converted to the correct types (price as number, stock as bigint). Check that the modal closes and shows success feedback after successful product creation. Ensure form reset after submission."
        },
        {
          "path": "frontend/src/components/ProductsTab.tsx",
          "operation": "modify",
          "description": "Verify that the ProductsTab correctly opens the ProductFormModal in 'add' mode when the 'Add Product' button is clicked. Ensure the products query refetches after the modal signals successful product creation. Check that the products table properly displays newly created products without requiring a page reload. Review error handling for failed product creation attempts."
        }
      ]
    }
  ]
}